tap "deskflow/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "jez/formulae"
tap "krishkrosh/apps"
tap "mike-engel/jwt-cli"
tap "robusta-dev/krr"
tap "steipete/tap"
tap "symfony-cli/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension to generate reports for standup meetings
brew "git-standup"
# Colorize logfiles and command output
brew "grc"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Terminal-based visual file manager
brew "midnight-commander"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Modern replacement for ps written in Rust
brew "procs"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Create beautiful image of your source code
brew "silicon"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Heatmap of oft-edited files
brew "jez/formulae/git-heatmap"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Kubernetes Resource Recommender by Robusta
brew "robusta-dev/krr/krr"
# Control web-based media players with media keys
cask "beardedspice"
# Universal chat app powered by Matrix
cask "beeper"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser@nightly"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk usage utility
cask "disk-inventory-x"
# Screen colour temperature controller
cask "flux-app"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Open-source screen recorder built with web technology
cask "kap"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Markdown editor with live preview and syntax highlighting
cask "macdown-3000"
# Extensible two-pane file manager
cask "marta"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Calculator and converter application
cask "numi"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Ruby on Rails IDE
cask "rubymine"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Customizable timing of breaks
cask "time-out"
# Open-source code editor
cask "visual-studio-code@insiders"
# REST, GraphQL and gRPC client
cask "yaak"
