davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
github.copilot-chat
johnpapa.vscode-peacock
mirone.milkdown
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
shopify.ruby-lsp
yandeu.five-server
yzhang.markdown-all-in-one
